{
    "exercises": [
      {
        "title": "forEach()",
        "exercise": "Recorre cada elemento del array y ejecuta una función para cada uno de ellos."
      },
      {
        "title": "map()",
        "exercise": "Crea un nuevo array con los resultados de aplicar una función a cada elemento del array original."
      },
      {
        "title": "filter()",
        "exercise": "Crea un nuevo array con todos los elementos que pasen una prueba (implementada por una función)."
      },
      {
        "title": "reduce()",
        "exercise": "Aplica una función a un acumulador y a cada elemento del array (de izquierda a derecha) para reducirlo a un solo valor."
      },
      {
        "title": "reduceRight()",
        "exercise": "Aplica una función a un acumulador y a cada elemento del array (de derecha a izquierda) para reducirlo a un solo valor."
      },
      {
        "title": "some()",
        "exercise": "Prueba si al menos un elemento en el array pasa la prueba implementada por la función proporcionada."
      },
      {
        "title": "every()",
        "exercise": "Prueba si todos los elementos en el array pasan la prueba implementada por la función proporcionada."
      },
      {
        "title": "find()",
        "exercise": "Devuelve el primer elemento del array que satisface la prueba implementada por la función proporcionada."
      },
      {
        "title": "findIndex()",
        "exercise": "Devuelve el índice del primer elemento del array que satisface la prueba implementada por la función proporcionada. Si no se encuentra, devuelve -1."
      },
      {
        "title": "keys()",
        "exercise": "Devuelve un nuevo objeto Array Iterator que contiene las claves para cada índice en el array."
      },
      {
        "title": "values()",
        "exercise": "Devuelve un nuevo objeto Array Iterator que contiene los valores para cada índice en el array."
      },
      {
        "title": "entries()",
        "exercise": "Devuelve un nuevo objeto Array Iterator que contiene pares clave/valor para cada índice en el array."
      },
      {
        "title": "for...of",
        "exercise": "Un bucle que permite recorrer los elementos de un array (y otros objetos iterables)."
      },
      {
        "title": "for...in",
        "exercise": "Un bucle que permite recorrer las claves (índices) de un array (aunque es más adecuado para objetos)."
      },
      {
        "title": "flat()",
        "exercise": "Devuelve un nuevo array con todos los elementos de sub-array concatenados en él de forma recursiva hasta la profundidad especificada."
      }
    ]
  }
  